# This file was generated with the following command:
#
#    $ brew bundle dump --global --all --describe
#
# It can be imported with:
#
#    $ brew bundle install --global
#
# For further information, run:
#
#    $ brew bundle --help
#
# Or check the GitHub repository: https://github.com/Homebrew/homebrew-bundle

tap "beeftornado/rmtree"
tap "clementtsang/bottom"
tap "eth-p/software"
tap "federico-terzi/espanso"
tap "github/gh"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "rigellute/tap"
tap "teamookla/speedtest"
tap "tomanthony/brews"
tap "versent/taps"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way to see and navigate directory trees
brew "broot"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
# brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# Select default apps for documents and URL schemes on macOS
# brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
# brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# See your latest local git branches, formatted real fancy
brew "git-recent"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# Render markdown on the CLI
brew "glow"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Simple jira command-line client in Go
brew "go-jira"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Development kit for the Java programming language
brew "openjdk@11"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Pager program similar to more
brew "less"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Port scanning utility for large networks
brew "nmap"
# Modern shell for the GitHub era
brew "nushell"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Object-relational database system
brew "postgresql"
# Cross-platform application and UI framework
brew "qt"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Spotify daemon
brew "spotifyd", restart_service: true
# Cross-shell prompt for astronauts
brew "starship"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# A cross-platform graphical process/system monitor with a customizable interface and a multitude of features.
brew "clementtsang/bottom/bottom"
# Diff a file against the current git index, or display the diff between two files
brew "eth-p/software/bat-extras-batdiff"
# Quickly search through and highlight files using ripgrep
brew "eth-p/software/bat-extras-batgrep"
# Read system manual pages using bat as the manual page formatter
brew "eth-p/software/bat-extras-batman"
# Less preprocessor for viewing more types of files in the terminal
brew "eth-p/software/bat-extras-batpipe"
# Watch for changes in one or more files, and print them with bat
brew "eth-p/software/bat-extras-batwatch"
# Cross-platform Text Expander written in Rust
brew "federico-terzi/espanso/espanso"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
# A terminal user interface for Spotify
brew "rigellute/tap/spotify-tui"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
brew "tomanthony/brews/itermocil"
brew "versent/taps/saml2aws"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Prebuilt OpenJDK binaries
# cask "adoptopenjdk8"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Inspect application bundles
cask "apparency"
# Audio utility
cask "background-music-pre"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organizer
cask "bartender"
# Desktop password and login vault
cask "bitwarden"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# Open-source browser prompter
cask "browserosaurus"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Utility for customizing which browser to start
cask "finicky"
# Web browser
cask "firefox-developer-edition"
cask "font-cascadia"
cask "font-caskaydiacove-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victormono-nerd-font"
# Web browser
cask "google-chrome-dev"
# Client for the Google Drive storage service
cask "google-drive"
# Client for the Google Drive storage service
cask "google-drive-file-stream"
# Tools to protect your emails and files
# cask "gpg-suite"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Power usage monitoring tool enabled for Intel Core processors
cask "intel-power-gadget"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "java"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customizer
cask "karabiner-elements"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# Untraceable cryptocurrency wallet
cask "monero-wallet"
# Open-source software for live streaming and screen recording
cask "obs"
# Utility to display the Dock in the Touch Bar
cask "pock"
# Collaboration platform for API development
cask "postman"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookapk"
# Emoji picker optimized for blind people
#cask "rocket"
# Web browser
cask "safari-technology-preview"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Application for inspecting installer packages
cask "suspicious-package"
cask "teamspeak-client"
# Web browser focusing on security
cask "tor-browser"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Set up, configure, manage and analyze your UniFi network
# cask "ubiquiti-unifi-controller"
# Free and open-source hosted hypervisor for x86 virtualization
# cask "virtualbox"
# AMD64/Intel64 and x86 virtualization
# cask "virtualbox-extension-pack"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
# cask "vmware-fusion"
# Network protocol analyzer
cask "wireshark"
# App wrapper for music.youtube.com
cask "yt-music"
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bluetooth Inspector", id: 1509085044
mas "Dato", id: 1470584107
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Jiffy", id: 1502527999
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pasteboard Viewer", id: 1499215709
mas "Plash", id: 1494023538
mas "Shareful", id: 1522267256
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "ToothFairy", id: 1191449274
mas "Toothpicks", id: 998361254
mas "UTC Time", id: 1538245904
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
